{
  "jobs": [
    {
      "company": "KLM",
      "role": "Frontend Developer",
      "startDate": "Apr 2023",
      "endDate": "Huidig",
      "description": "Bijgedragen aan de ontwikkeling van de commerciële KLM-website, dagelijks gebruikt door honderdduizenden bezoekers wereldwijd. Verantwoordelijk voor het boekingsproces van searchbox tot confirmation page en het implementeren van deploymentstrategieën voor naadloze updates en gebruikerssessies. Gefocust op het moderniseren van legacy-code, verbeteren van gebruiksvriendelijkheid en toegankelijkheid (WCAG-standaarden) en het optimaliseren van prestaties en codekwaliteit in samenwerking met het team.",
      "technologies": [
        "Angular",
        "TypeScript",
        "RxJS",
        "HTML",
        "SASS",
        "Jest",
        "Cypress",
        "GraphQL"
      ],
      "link": ""
    },
    {
      "company": "Backbase",
      "role": "Frontend Developer",
      "startDate": "Jul 2022",
      "endDate": "Apr 2023",
      "description": "Bijgedragen aan de implementatie van een nieuw online bankplatform voor een klant in Cyprus, inclusief de ontwikkeling van betaalpagina's en rekeningoverzichten. Samen met het Nederlandse team werkte ik nauw samen met internationale teams en stakeholders, met strikte naleving van beveiligingsprotocollen binnen de financiële dienstverlening. De focus lag op gebruikerservaring (UX) en bruikbaarheid, door geavanceerde functionaliteiten te combineren met een intuïtief ontwerp (UI) om klanttevredenheid en betrokkenheid te vergroten.",
      "technologies": ["Angular", "TypeScript", "RxJS", "HTML", "SASS", "Jest"],
      "link": ""
    },
    {
      "company": "Athlon Car Lease",
      "role": "Lead Frontend Developer",
      "startDate": "Jun 2021",
      "endDate": "Jul 2022",
      "description": "Leidde de ontwikkeling van een digitale zelfservice-procesengine die zowel grensoverschrijdende als lokale vereisten accommodeerde. Gedurende de implementatie van deze nieuwe functionaliteit introduceerde ik het team aan verbeterde coderingsstandaarden, waaronder statusbeheer met behulp van RxJS, unit testing met Jest, en de adoptie van slimme/domme componentstructuren, waardoor de algehele codekwaliteit en onderhoudbaarheid werden verbeterd.",
      "technologies": [
        "Angular",
        "Typescript",
        "RxJS",
        "Azure",
        "Jenkins",
        "Storybook",
        "HTML",
        "SCSS",
        "Jest"
      ]
    },
    {
      "company": "Dutch railways",
      "role": "JavaScript Developer",
      "startDate": "Jun 2020",
      "endDate": "May 2021",
      "description": "Ik heb bijgedragen aan de ontwikkeling en het onderhoud van meerdere applicaties die een cruciale rol spelen in de digitale transformatie. Een belangrijke prestatie in deze periode was de succesvolle oplevering van de nieuwe applicatie TRIP, die operationele processen aanzienlijk heeft gestroomlijnd.",
      "technologies": [
        "Angular",
        "Angular Material",
        "NX",
        "RxJS",
        "Azure",
        "Storybook",
        "Cypress",
        "Swagger"
      ]
    },
    {
      "company": "Schiphol Group",
      "role": "JavaScript Developer",
      "startDate": "Sep 2018",
      "endDate": "Mar 2020",
      "description": "Ik heb bijgedragen aan de ontwikkeling van een robuust platform dat gebruikmaakt van live data om real-time inzichten te bieden in de operationele processen op Schiphol Airport. Door het integreren van meerdere databronnen stelt de applicatie gebruikers in staat om capaciteitsproblemen proactief te identificeren en op te lossen, wat de operationele efficiëntie en besluitvorming aanzienlijk verbetert.",
      "technologies": [
        "Angular",
        "TypeScript",
        "RxJS",
        "Kafka",
        "Node.js",
        "Express",
        "Docker",
        "Jenkins",
        "HTML",
        "CSS",
        "Cypress",
        "Jest"
      ]
    },
    {
      "company": "KLM",
      "role": "Frontend Developer",
      "startDate": "Jul 2017",
      "endDate": "Aug 2018",
      "description": "Bij KLM werkte ik in een startup-achtige omgeving als enige frontend developer binnen een klein team, waar we door een agile werkwijze snel konden itereren en maximale waarde toevoegden aan de applicatie.",
      "technologies": [
        "Angular",
        "JavaScript",
        "Node.js",
        "Express",
        "HTML",
        "CSS",
        "Docker",
        "Bamboo"
      ]
    },
    {
      "company": "KPN",
      "role": "Frontend Developer",
      "startDate": "Jan 2016",
      "endDate": "May 2017",
      "description": "Bij KPN heb ik samen met het scrumteam de gesloten omgeving van Telfort.nl volledig herbouwd om de gebruikerservaring te verbeteren en snellere laadtijden te realiseren. Mijn verantwoordelijkheden omvatten het converteren van bestaande functionaliteiten naar een nieuw framework voor betere prestaties en onderhoudbaarheid, het implementeren van een nieuw ontwerp met herbruikbare componenten voor een consistente en efficiënte gebruikersinterface, en het coördineren met het back-end team over API’s en datastructuren voor een naadloze integratie en datastroom.",
      "technologies": ["Angular", "JS", "JavaScript", "HTML", "CSS", "Jenkins"]
    },
    {
      "company": "Vliegtickets.nl",
      "role": "Developer",
      "startDate": "Jun 2013",
      "endDate": "Dec 2015",
      "description": "Bij vliegtickets.nl was ik verantwoordelijk voor het onderhoud en de ontwikkeling van nieuwe functionaliteiten voor meerdere merken, waaronder vliegtickets.nl, vliegtickets.be, vliegtarieven.nl, wtc.nl en schipholtickets.nl. Mijn werkzaamheden omvatten het implementeren van campagnepagina’s op basis van Photoshop-ontwerpen, het stylen van het boekingsproces volgens de visuele identiteit van nieuwe merken, en het uitvoeren van A/B-testen om de gebruikerservaring te optimaliseren en conversieratio’s te verbeteren.",
      "technologies": [
        "PHP",
        "JavaScript",
        "JQuery",
        "CSS",
        "HTML",
        "ZF1",
        "Jenkins"
      ]
    }
  ]
}
